app/views/scripts/_form.html.haml

      .controls
        = f.select :test_id, Test.all.map{|t| [t.name, t.id]}
---
SELECT "tests".* FROM "tests"