app/views/scripts/index.html.haml

        %td
          - script.script_themes.each do |script_theme|
---
SELECT "scripts".* FROM "scripts"