app/views/scripts/show.html.haml

%p= @script.blocked ? "Да" : "Нет"
%span{:class => "label"}= t("activerecord.attributes.script.order_themes") + ":"
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT 1  [["id", "1"]]