app/views/themes/_form.html.haml

SELECT "disciplines".* FROM "disciplines"
---
    &nbsp;
    = f.select :discipline_id, Discipline.all.map{|d| [d.name, d.id]}
  .actions