app/views/groups/_form.html.haml

SELECT "disciplines".* FROM "disciplines" INNER JOIN "disciplines_groups" ON "disciplines"."id" = "disciplines_groups"."discipline_id" WHERE "disciplines_groups"."group_id" = 1
---
      .controls
        =f.text_field :discipline_tokens, "data-pre"=>@group.disciplines.map(&:attributes).to_json
    .form-actions