app/views/groups/index.html.haml

    %tr
      %th= t "activerecord.attributes.group.name"
---
SELECT "groups".* FROM "groups"