app/views/groups/show.html.haml

  %b Дисциплины:
  - @group.disciplines.each do |discipline|
---
SELECT "disciplines".* FROM "disciplines" INNER JOIN "disciplines_groups" ON "disciplines"."id" = "disciplines_groups"."discipline_id" WHERE "disciplines_groups"."group_id" = 1