app/views/sub_themes/_form.html.haml

SELECT "themes".* FROM "themes"
---
    = f.label :theme_id
    = f.select :theme_id, Theme.all.map{|t| [t.name, t.id]}
  .actions