app/controllers/disciplines_controller.rb

SELECT "disciplines".* FROM "disciplines" WHERE (lower(name) LIKE lower('%п%'))
---
  def index
    @disciplines = Discipline.all

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @discipline = Discipline.find(params[:id])

INSERT INTO "disciplines" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 28 Feb 2012 22:04:23 UTC +00:00], ["name", "\320\222"], ["updated_at", Tue, 28 Feb 2012 22:04:23 UTC +00:00]]
---
  def create
    @discipline = Discipline.new(params[:discipline])

    respond_to do |format|
      if @discipline.save

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "disciplines" WHERE "disciplines"."id" = ?  [["id", 1]]
---
  def destroy
    @discipline = Discipline.find(params[:id])
    @discipline.destroy