app/controllers/groups_controller.rb

  def index
    if params[:discipline].nil?
      @groups = Group.all
    else
      @groups = Group.includes(:disciplines).where("disciplines.id = ?", params[:discipline])
      @themes = Theme.where(:discipline_id => params[:discipline])
---
SELECT "groups".* FROM "groups"
SELECT "themes".* FROM "themes" WHERE "themes"."discipline_id" = 7

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Tue, 28 Feb 2012 22:05:25 UTC +00:00], ["name", "8362"], ["updated_at", Tue, 28 Feb 2012 22:05:25 UTC +00:00], ["year", "2011/2012"]]