app/controllers/scripts_controller.rb

  def index
    @scripts = Script.includes(:test).all
---
SELECT "scripts".* FROM "scripts"
SELECT "tests".* FROM "tests" WHERE "tests"."id" IN (1)

  def show
    @script = Script.includes(:test).find(params[:id])
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" IN (1)