app/controllers/sub_themes_controller.rb

  def index
    @sub_themes = SubTheme.all
---
SELECT "sub_themes".* FROM "sub_themes"