app/controllers/tests_controller.rb

  def index
    if params[:discipline].nil? and params[:group].nil?
      @tests = Test.all
---
SELECT "tests".* FROM "tests"

  def show
    @test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @test = Test.new(params[:test])

    respond_to do |format|
      if @test.save
---
INSERT INTO "tests" ("auth_type", "block", "created_at", "disciplines_groups_id", "ext_access", "msiu_access", "name", "necessary", "num_try", "oder", "period", "question_pct", "theme_pct", "type", "updated_at", "w_key") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)