app/controllers/themes_controller.rb

  def index
    @themes = Theme.all
---
SELECT "themes".* FROM "themes"