app/views/tests/_form.html.haml

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" IN (6, 4, 7, 8, 9, 11, 10, 12, 14, 15, 13, 5, 2, 3)
SELECT "disciplines_groups".* FROM "disciplines_groups"
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (1, 2, 3, 4, 5, 6, 7, 8)
---
    &nbsp;
    = f.select :disciplines_groups_id, DisciplinesGroups.includes(:discipline, :group).all.map{|dg| [dg.discipline.name+" - "+dg.group.name+" - "+dg.group.year, dg.id]}
  .field