app/views/tests/index.html.haml

      %td
        - test.scripts.each do |script|
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."test_id" = 1