app/views/tests/show.html.haml

    %th Список сценариев
  - @test.scripts.each do |script|
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."test_id" = 1