app/views/tests/show.html.haml

%p= @test.msiu_access
%label{:class => "label"}= t("activerecord.attributes.test.order", :default => t("activerecord.labels.order", :default => "Order")) + ":"
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT 1  [["id", "1"]]